package ru.anseranser.cases;

import lombok.Getter;

@Getter
public class Accusative implements Case {
    public final String[] billions = {
            "миллиардов",
            "миллиард",
            "миллиарда",
            "миллиарда",
            "миллиарда",
            "миллиардов",
            "миллиардов",
            "миллиардов",
            "миллиардов",
            "миллиардов"
    };

    public final String[] millions = {
            "миллионов",
            "миллион",
            "миллиона",
            "миллиона",
            "миллиона",
            "миллионов",
            "миллионов",
            "миллионов",
            "миллионов",
            "миллионов"
    };

    public final String[] thousands = {
            "тысяч",
            "тысячу",
            "тысячи",
            "тысячи",
            "тысячи",
            "тысяч",
            "тысяч",
            "тысяч",
            "тысяч",
            "тысяч"
    };

    public final String[] hundreds = {
            "",
            "сто",
            "двести",
            "триста",
            "четыреста",
            "пятьсот",
            "шестьсот",
            "семьсот",
            "восемьсот",
            "девятьсот"
    };

    public final String[] tens = {
            "",
            "десять",
            "двадцать",
            "тридцать",
            "сорок",
            "пятьдесят",
            "шестьдесят",
            "семьдесят",
            "восемьдесят",
            "девяносто"
    };

    public final String[] teens = {
            "", "", "", "", "", "", "", "", "", "", "",
            "одиннадцать",
            "двенадцать",
            "тринадцать",
            "четырнадцать",
            "пятнадцать",
            "шестнадцать",
            "семнадцать",
            "восемнадцать",
            "девятнадцать"
    };

    public final String[] masculineOnes = {"", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"};
    public final String[] feminineOnes = {"", "одну", "две", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"};
    public final String[] neuterOnes = {"", "одно", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"};

}
