package ru.anseranser.cases;

import lombok.Getter;

@Getter
public class Accusative implements Case {
    private final String[] billions = {
            "миллиардов",
            "миллиард",
            "миллиарда",
            "миллиарда",
            "миллиарда",
            "миллиардов",
            "миллиардов",
            "миллиардов",
            "миллиардов",
            "миллиардов"
    };

    private final String[] millions = {
            "миллионов",
            "миллион",
            "миллиона",
            "миллиона",
            "миллиона",
            "миллионов",
            "миллионов",
            "миллионов",
            "миллионов",
            "миллионов"
    };

    private final String[] thousands = {
            "тысяч",
            "тысячу",
            "тысячи",
            "тысячи",
            "тысячи",
            "тысяч",
            "тысяч",
            "тысяч",
            "тысяч",
            "тысяч"
    };

    private final String[] hundreds = {
            "",
            "сто",
            "двести",
            "триста",
            "четыреста",
            "пятьсот",
            "шестьсот",
            "семьсот",
            "восемьсот",
            "девятьсот"
    };

    private final String[] tens = {
            "",
            "десять",
            "двадцать",
            "тридцать",
            "сорок",
            "пятьдесят",
            "шестьдесят",
            "семьдесят",
            "восемьдесят",
            "девяносто"
    };

    private final String[] teens = {
            "", "", "", "", "", "", "", "", "", "", "",
            "одиннадцать",
            "двенадцать",
            "тринадцать",
            "четырнадцать",
            "пятнадцать",
            "шестнадцать",
            "семнадцать",
            "восемнадцать",
            "девятнадцать"
    };

    private final String[] masculineOnes = {
            "ноль",
            "один",
            "два",
            "три",
            "четыре",
            "пять",
            "шесть",
            "семь",
            "восемь",
            "девять"
    };

    private final String[] feminineOnes = {
            "ноль",
            "одну",
            "две",
            "три",
            "четыре",
            "пять",
            "шесть",
            "семь",
            "восемь",
            "девять"
    };

    private final String[] neuterOnes = {
            "ноль",
            "одно",
            "два",
            "три",
            "четыре",
            "пять",
            "шесть",
            "семь",
            "восемь",
            "девять"
    };

}
