package ru.anseranser.cases;

import lombok.Getter;

@Getter
public class Dative implements Case {
    public final String[] billions = {
            "миллиардам",
            "миллиарду",
            "миллиардам",
            "миллиардам",
            "миллиардам",
            "миллиардам",
            "миллиардам",
            "миллиардам",
            "миллиардам",
            "миллиардам"
    };

    public final String[] millions = {
            "миллионам",
            "миллиону",
            "миллионам",
            "миллионам",
            "миллионам",
            "миллионам",
            "миллионам",
            "миллионам",
            "миллионам",
            "миллионам"
    };

    public final String[] thousands = {
            "тысячам",
            "тысяче",
            "тысячам",
            "тысячам",
            "тысячам",
            "тысячам",
            "тысячам",
            "тысячам",
            "тысячам",
            "тысячам"
    };

    public final String[] hundreds = {
            "",
            "ста",
            "двумстам",
            "трёмстам",
            "четырёмстам",
            "пятистам",
            "шестистам",
            "семистам",
            "восьмистам",
            "девятистам"
    };

    public final String[] tens = {
            "",
            "десяти",
            "двадцати",
            "тридцати",
            "сорока",
            "пятидесяти",
            "шестидесяти",
            "семидесяти",
            "восьмидесяти",
            "девяноста"
    };

    public final String[] teens = {
            "", "", "", "", "", "", "", "", "", "", "",
            "одиннадцати",
            "двенадцати",
            "тринадцати",
            "четырнадцати",
            "пятнадцати",
            "шестнадцати",
            "семнадцати",
            "восемнадцати",
            "девятнадцати"
    };

    public final String[] masculineOnes = {"", "одному", "двум", "трём", "четырём", "пяти", "шести", "семи", "восьми", "девяти"};
    public final String[] feminineOnes = {"", "одной", "двум", "трём", "четырём", "пяти", "шести", "семи", "восьми", "девяти"};
    public final String[] neuterOnes = {"", "одному", "двум", "трём", "четырём", "пяти", "шести", "семи", "восьми", "девяти"};
}

