package ru.anseranser.cases;

import lombok.Getter;

@Getter
public class Dative implements Case {
    private final String[] billions = {
            "миллиардам",
            "миллиарду",
            "миллиардам",
            "миллиардам",
            "миллиардам",
            "миллиардам",
            "миллиардам",
            "миллиардам",
            "миллиардам",
            "миллиардам"
    };

    private final String[] millions = {
            "миллионам",
            "миллиону",
            "миллионам",
            "миллионам",
            "миллионам",
            "миллионам",
            "миллионам",
            "миллионам",
            "миллионам",
            "миллионам"
    };

    private final String[] thousands = {
            "тысячам",
            "тысяче",
            "тысячам",
            "тысячам",
            "тысячам",
            "тысячам",
            "тысячам",
            "тысячам",
            "тысячам",
            "тысячам"
    };

    private final String[] hundreds = {
            "",
            "ста",
            "двумстам",
            "трёмстам",
            "четырёмстам",
            "пятистам",
            "шестистам",
            "семистам",
            "восьмистам",
            "девятистам"
    };

    private final String[] tens = {
            "",
            "десяти",
            "двадцати",
            "тридцати",
            "сорока",
            "пятидесяти",
            "шестидесяти",
            "семидесяти",
            "восьмидесяти",
            "девяноста"
    };

    private final String[] teens = {
            "", "", "", "", "", "", "", "", "", "", "",
            "одиннадцати",
            "двенадцати",
            "тринадцати",
            "четырнадцати",
            "пятнадцати",
            "шестнадцати",
            "семнадцати",
            "восемнадцати",
            "девятнадцати"
    };

    private final String[] masculineOnes = {
            "",
            "одному",
            "двум",
            "трём",
            "четырём",
            "пяти",
            "шести",
            "семи",
            "восьми",
            "девяти"
    };

    private final String[] feminineOnes = {
            "",
            "одной",
            "двум",
            "трём",
            "четырём",
            "пяти",
            "шести",
            "семи",
            "восьми",
            "девяти"
    };

    private final String[] neuterOnes = masculineOnes;
}

