package ru.anseranser.cases;

import lombok.Getter;

@Getter
public class Genitive implements Case {
    private final String[] billions = {
            "миллиардов",
            "миллиарда",
            "миллиардов",
            "миллиардов",
            "миллиардов",
            "миллиардов",
            "миллиардов",
            "миллиардов",
            "миллиардов",
            "миллиардов"
    };

    private final String[] millions = {
            "миллионов",
            "миллиона",
            "миллионов",
            "миллионов",
            "миллионов",
            "миллионов",
            "миллионов",
            "миллионов",
            "миллионов",
            "миллионов"
    };

    private final String[] thousands = {
            "тысяч",
            "тысячи",
            "тысяч",
            "тысяч",
            "тысяч",
            "тысяч",
            "тысяч",
            "тысяч",
            "тысяч",
            "тысяч"
    };

    private final String[] hundreds = {
            "",
            "ста",
            "двухсот",
            "трехсот",
            "четырехсот",
            "пятисот",
            "шестисот",
            "семисот",
            "восьмисот",
            "девятисот"
    };

    private final String[] tens = {
            "",
            "десяти",
            "двадцати",
            "тридцати",
            "сорока",
            "пятидесяти",
            "шестидесяти",
            "семидесяти",
            "восьмидесяти",
            "девяноста"
    };

    private final String[] teens = {
            "", "", "", "", "", "", "", "", "", "", "",
            "одиннадцати",
            "двенадцати",
            "тринадцати",
            "четырнадцати",
            "пятнадцати",
            "шестнадцати",
            "семнадцати",
            "восемнадцати",
            "девятнадцати"
    };

    private final String[] masculineOnes = {
            "ноля",
            "одного",
            "двух",
            "трёх",
            "четырёх",
            "пяти",
            "шести",
            "семи",
            "восьми",
            "девяти"
    };

    private final String[] feminineOnes = {
            "ноля",
            "одной",
            "двух",
            "трёх",
            "четырёх",
            "пяти",
            "шести",
            "семи",
            "восьми",
            "девяти"
    };

    private final String[] neuterOnes = masculineOnes;
}
