package ru.anseranser.cases;

import lombok.Getter;

import java.util.Arrays;

@Getter
public class Prepositional implements Case {
    public final String[] billions = {
            "миллиардах",
            "миллиарде",
            "миллиардах",
            "миллиардах",
            "миллиардах",
            "миллиардах",
            "миллиардах",
            "миллиардах",
            "миллиардах",
            "миллиардах"
    };

    public final String[] millions = {
            "миллионах",
            "миллионе",
            "миллионах",
            "миллионах",
            "миллионах",
            "миллионах",
            "миллионах",
            "миллионах",
            "миллионах",
            "миллионах"
    };

    public final String[] thousands = {
            "тысячах",
            "тысяче",
            "тысячах",
            "тысячах",
            "тысячах",
            "тысячах",
            "тысячах",
            "тысячах",
            "тысячах",
            "тысячах"
    };

    public final String[] hundreds = {
            "",
            "ста",
            "двухстах",
            "трёхстах",
            "четырёхстах",
            "пятистах",
            "шестистах",
            "семистах",
            "восьмистах",
            "девятистах"
    };

    public final String[] tens = {
            "",
            "десяти",
            "двадцати",
            "тридцати",
            "сорока",
            "пятидесяти",
            "шестидесяти",
            "семидесяти",
            "восьмидесяти",
            "девяноста"
    };

    public final String[] teens = {
            "", "", "", "", "", "", "", "", "", "", "",
            "одиннадцати",
            "двенадцати",
            "тринадцати",
            "четырнадцати",
            "пятнадцати",
            "шестнадцати",
            "семнадцати",
            "восемнадцати",
            "девятнадцати"
    };

    public final String[] masculineOnes = {
            "",
            "одном",
            "двух",
            "трёх",
            "четырёх",
            "пяти",
            "шести",
            "семи",
            "восьми",
            "девяти"
};
    public final String[] feminineOnes = {
            "",
            "одной",
            "двух",
            "трёх",
            "четырёх",
            "пяти",
            "шести",
            "семи",
            "восьми",
            "девяти"
    };

    public final String[] neuterOnes = masculineOnes;
}
